04_CFD/pipeline/sweep_run/cases/d-10p0_M0p100_aoa+8p0/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    mainfoil
    {
        type            zeroGradient;
    }

    flap
    {
        type            zeroGradient;
    }

    farfield
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
